In [1]:
import pandas as pd

In [2]:
friend_list = [
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]

In [3]:
df = pd.DataFrame.from_items(friend_list)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

In [4]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [5]:
# 제니와 네이트 정보만 가지고 싶을때 (index:1,2)
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [6]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [7]:
df = df[1:3] # 원하는 자료를 추출하고 할당해줘야지 결과값이 업데이트 된다.

In [8]:
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [9]:
df = pd.DataFrame.from_items(friend_list)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

In [10]:
df # 불연속적인 경우

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [12]:
df.loc[[0,2]] # location 함수: 원하는 row의 index를 넣어서 필요한 데이터만 추출 가능

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [13]:
df = df.loc[[0,2]] # 존과 네이트만 가져오는 경우

In [14]:
df

   name  age      job
0  John   20  student
2  Nate   30  teacher

### by column condition

In [17]:
df = pd.DataFrame.from_items(friend_list)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

In [18]:
# 예를 들어 나이가 25살 이상인 사람인 경우만 필요할때
df[df.age>25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [19]:
df.query('age>25') # 위 코드와 같은 효과

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [22]:
df[(df.age>25) & (df.name == 'Nate')] # 나이가 25살 이상이고 이름이 Nate인 사람을 추출

   name  age      job
2  Nate   30  teacher

## Filter Column

### by index

In [23]:
friend_list = [
    ['John',20,'student'],
    ['Jenny',30,'developer'],
    ['Nate',30,'teacher']
]

In [24]:
df = pd.DataFrame.from_records(friend_list)

In [25]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [26]:
# index 0번과 1번만 필요한 경우 
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

### by column name

In [31]:
df = pd.read_csv('./friend_list_no_head.csv',header=None,names=['name','age','job'])

In [32]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [34]:
df_filtered = df[['name','age']]

In [35]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [38]:
df.filter(items=['age','job']) # 위 코드와 같은 효과

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [39]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [40]:
df.filter(like='a',axis = 1) # 컬럼 name에 'a'가 들어간 것만 추출

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [41]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [43]:
df.filter(regex='b$',axis=1) # 정규식

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern